#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(СимвольныйКод) Тогда

		СимвольныйКод = ВРег(СокрЛП(СимвольныйКод));

	КонецЕсли;

	Если ЗначениеЗаполнено(ЦифровойКод) Тогда

		Если СтрДлина(ЦифровойКод) <> 3 Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Цифровой код валюты должен содержать 3 цифры.";
			Сообщение.Сообщить();

			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Для НомерСимвола = 1 По 3 Цикл

			Если СтрНайти("0123456789", Сред(ЦифровойКод, НомерСимвола, 1)) = 0 Тогда

				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Цифровой код валюты должен содержать только цифры.";
				Сообщение.Сообщить();

				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Если Кратность <= 0 Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Кратность валюты должна быть больше нуля.";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли