#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    Если ЗначениеЗаполнено(СимвольныйКод) Тогда

        СимвольныйКод = ВРег(СокрЛП(СимвольныйКод));

    КонецЕсли;

	Если Кратность <= 0 Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Кратность валюты должна быть больше нуля.";
    	Сообщение.Сообщить();
    	Отказ = Истина;
    Возврат;

КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли