// @strict-types

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Элементы.ДекорацияИнформацияОВалютеУчета.Заголовок = СформироватьТекстОсновнойВалюты(ВалютаУчета); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 // Формирует форматированную строку с информацией о валюте учёта.
 //
 // Параметры: 
 // 	Валюта - СправочникСсылка.Валюты - ссылка на выбранную валюту учёта.
 //
 // Возвращаемое значение:
 //		ФорматированнаяСтрока - текст с пояснением о выбранной валюте учёта
 //         либо инструкцией по её назначению.
 //
&НаСервере
Функция СформироватьТекстОсновнойВалюты(Валюта)
	
	ШрифтОбычный = Новый Шрифт(,10);
	ШрифтЖирный  = Новый Шрифт(,10, Истина);
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		Результат = Новый ФорматированнаяСтрока(
				Новый ФорматированнаяСтрока(НСтр("ru = 'Валютой учета выбрана'", ), ШрифтОбычный),
				Новый ФорматированнаяСтрока(" <", ),
				Новый ФорматированнаяСтрока(Строка(Валюта), ШрифтЖирный),
				Новый ФорматированнаяСтрока(">. ", ШрифтОбычный),
				Новый ФорматированнаяСтрока(НСтр("ru = 'В этой валюте рассчитывается финансовый результат и хранятся курсы других валют'", ), ШрифтОбычный)
				);
		
	Иначе
		Результат = Новый ФорматированнаяСтрока(
				Новый ФорматированнаяСтрока(НСтр("ru = 'Не выбрана валюта учета! Выделите в списке нужную валюту и выберите в меню команду'", ), ШрифтОбычный),
				Новый ФорматированнаяСтрока(" """, ШрифтОбычный),
				Новый ФорматированнаяСтрока(НСтр("ru = 'Назначить валютой учета'", ), ШрифтЖирный),
				Новый ФорматированнаяСтрока(""" ", ШрифтОбычный)
				);
		
	КонецЕсли; 
	Возврат Результат;

КонецФункции

#КонецОбласти
