#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(КорреспондентскийСчет) Тогда

		Если СтрДлина(КорреспондентскийСчет) <> 20 Тогда

			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Корреспондентский счет должен содержать 20 цифр.";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Для НомерСимвола = 1 По 20 Цикл

			СимволСчета = Сред(КорреспондентскийСчет, НомерСимвола, 1);

			Если СтрНайти("0123456789", СимволСчета) = 0 Тогда

				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Корреспондентский счет должен содержать только цифры.";
				СообщениеПользователю.Сообщить();

				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	Если ЗначениеЗаполнено(БИК) Тогда

		Если СтрДлина(БИК) <> 9 Тогда

			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "БИК должен содержать 9 цифр.";
			СообщениеПользователю.Сообщить();
			
			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Для НомерСимвола = 1 По 9 Цикл

			Если СтрНайти("0123456789", Сред(БИК, НомерСимвола, 1)) = 0 Тогда

				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "БИК должен содержать только цифры.";
				СообщениеПользователю.Сообщить();
				
				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	ТелефонБанка = НормализоватьТелефон(ТелефонБанка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НормализоватьТелефон(НомерТелефона)

	Результат = СокрЛП(НомерТелефона);

	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, "-", "");
	Результат = СтрЗаменить(Результат, "(", "");
	Результат = СтрЗаменить(Результат, ")", "");

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли